app/Controllers/Frontend/Login.php

  public function signup($signup_step = false) {
    helper(['form', 'url']);
    $this->data['error'] = '';

    if ($this->request->getMethod() === 'POST') {
        $rules = [
            'screenName' => 'required|min_length[6]|max_length[20]',
            'email' => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[5]'
        ];

        if ($this->validation->setRules($rules)) {

            $email = $this->request->getPost('email');

            if($this->users->checkEmail($email)){
      			     $this->data['error'] = 'Email is already in use';
      			}else {
              $newData = [
                  'screenName' => $this->request->getPost('screenName'),
                  'email' => $this->request->getPost('email'),
                  'password' => md5($this->request->getPost('password')) // Consider using password_hash in real applications
              ];

              $this->users->save($newData);
---
INSERT INTO `users` (`screenName`, `email`, `password`) VALUES ('Kucing Ganteng', 'kucingganteng@gmail.com', '4a52e921dddf5541ea089554bf16a5d8')