app/Helpers/follow_helper.php

  function checkFollow($followerID, $user_id)
  {
      // Check if a user is following another user
      $db = Database::connect();
      $builder = $db->table('follow');
      $builder->where('sender', $user_id);
      $builder->where('receiver', $followerID);
      $query = $builder->get();
---
SELECT *
FROM `follow`
WHERE `sender` = '6'
AND `receiver` = '6'