app/Helpers/tweet_helper.php

SELECT *
FROM `tweets`
WHERE `retweetID` = '7'
AND `retweetBy` = '6'
---
    function checkRetweet($tweet_id, $user_id)
    {
        // Get database instance
        $db = Database::connect();
        $builder = $db->table('tweets');

        // Check if the tweet is retweeted by the user
        $builder->where('retweetID', $tweet_id);
        $builder->where('retweetBy', $user_id);
        $query = $builder->get();

SELECT *
FROM `likes`
WHERE `likeBy` = '6'
AND `likeOn` = '7'
---
  function likes($user_id, $tweet_id) {
      $db = Database::connect();
      $builder = $db->table('likes');
      $builder->where('likeBy', $user_id);
      $builder->where('likeOn', $tweet_id);
      $query = $builder->get();

SELECT *
FROM `users`
WHERE `user_id` = '0'
---
  function userData($user_id)
  {
      $db = Database::connect();
      // Retrieve user data by user_id
      $builder = $db->table('users');
      $builder->where('user_id', $user_id);
      $query = $builder->get();