app/Models/Follow.php

SELECT *
FROM `users`
WHERE `user_id` != '6'
AND `user_id` NOT IN (SELECT receiver FROM follow WHERE sender = 6)
ORDER BY RAND()
 LIMIT 3
---
    public function whoToFollow($user_id)
    {
        // Suggest users to follow
        $db = \Config\Database::connect();
        $builder = $db->table('users');

        // Build a raw SQL condition for the subquery
        $subquery = "(SELECT receiver FROM follow WHERE sender = " . (int) $user_id . ")";

        $builder->where('user_id !=', $user_id);
        $builder->where("user_id NOT IN {$subquery}"); // Using the raw subquery
        $builder->orderBy('RAND()');
        $builder->limit(3);

        $query = $builder->get();