app/Models/Messages.php

    public function notificationViewed($user_id)
    {
        // Mark all notifications as viewed
        $builder = \Config\Database::connect()->table('notification');
        $builder->set('status', '1');
        $builder->where('notificationFor', $user_id);
        $builder->update();
---
UPDATE `notification` SET `status` = '1'
WHERE `notificationFor` = '9'

    public function notification($user_id)
    {
        // Establish a database connection
        $db = \Config\Database::connect();

        // Create a builder for 'notification'
        $builder = $db->table('notification');

        // Build the query with multiple LEFT JOINs
        $builder->select('notification.*, users.*, tweets.*, likes.*, follow.*') // Adjust fields as needed
                ->join('users', 'notification.notificationFrom = users.user_id', 'left')
                ->join('tweets', 'notification.target = tweets.tweetID', 'left')
                ->join('likes', 'notification.target = likes.likeOn', 'left')
                ->join('follow', 'notification.notificationFrom = follow.sender AND notification.notificationFor = follow.receiver', 'left')
                ->where('notification.notificationFor', $user_id) // Filter by user_id
                ->where('notification.notificationFrom !=', $user_id) // Exclude self-generated notifications
                ->groupBy('ID'); // Group by ID

        // Execute the query and get the results as an array of objects
        $query = $builder->get();
---
SELECT `notification`.*, `users`.*, `tweets`.*, `likes`.*, `follow`.*
FROM `notification`
LEFT JOIN `users` ON `notification`.`notificationFrom` = `users`.`user_id`
LEFT JOIN `tweets` ON `notification`.`target` = `tweets`.`tweetID`
LEFT JOIN `likes` ON `notification`.`target` = `likes`.`likeOn`
LEFT JOIN `follow` ON `notification`.`notificationFrom` = `follow`.`sender` AND `notification`.`notificationFor` = `follow`.`receiver`
WHERE `notification`.`notificationFor` = '9'
AND `notification`.`notificationFrom` != '9'
GROUP BY `ID`