app/Models/Trends.php

    public function getTrends()
    {
        $builder = $this->table('trends');
        $builder->select('trends.*, COUNT(tweets.tweetID) AS tweetsCount');
        $builder->join('tweets', "tweets.status LIKE CONCAT('%#', trends.hashtag, '%') OR tweets.retweetMsg LIKE CONCAT('%#', trends.hashtag, '%')", 'inner');
        $builder->groupBy('trends.hashtag');
        $builder->orderBy('tweetsCount', 'DESC');
        $builder->limit(2);

        $query = $builder->get();
---
SELECT `trends`.*, COUNT(tweets.tweetID) AS tweetsCount
FROM `trends`
INNER JOIN `tweets` ON `tweets`.`status` LIKE CONCAT('%#', trends.hashtag, '%') OR `tweets`.`retweetMsg` LIKE CONCAT('%#', trends.hashtag, '%')
GROUP BY `trends`.`hashtag`
ORDER BY `tweetsCount` DESC
 LIMIT 2