app/Models/Users.php

    public function userData($user_id)
    {
        return $this->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = 8

    public function updateUsername($user_id, $username)
    {
        // Updates the username for a specific user
        return $this->update($user_id, ['username' => $username]);
---
UPDATE `users` SET `username` = 'kucingganteng'
WHERE `users`.`user_id` IN (8)

    public function checkUsername($username)
    {
        // Checks if the username already exists in the users table
        return $this->where('username', $username)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `username` = 'kucingganteng'

    public function checkEmail($email)
    {
        // Checks if the email already exists in the users table
        return $this->where('email', $email)->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `email` = 'kucingganteng@gmail.com'