app/Models/Users.php

    public function search($search)
    {
        // Search for users by username or screenName
        $builder = $this->table('users');
        $builder->like('username', $search);
        $builder->orLike('screenName', $search);
        $query = $builder->get();
---
SELECT *
FROM `users`
WHERE `username` LIKE '%d%' ESCAPE '!'
OR  `screenName` LIKE '%d%' ESCAPE '!'

    public function userData($user_id)
    {
        // Retrieve user data by user_id
        $builder = $this->table('users');
        $builder->where('user_id', $user_id);
        $query = $builder->get();
---
SELECT *
FROM `users`
WHERE `user_id` = '6'

    public function UserIdByUsername($username)
    {
        $builder = $this->db->table($this->table);
        $builder->select('user_id');
        $builder->where('username', $username);

        $query = $builder->get();
---
SELECT `user_id`
FROM `users`
WHERE `username` = 'marshaadp'